{"id":1199,"date":"2020-03-03T19:05:00","date_gmt":"2020-03-03T19:05:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=1199"},"modified":"2025-08-14T21:38:29","modified_gmt":"2025-08-14T21:38:29","slug":"ffestiniog-and-welsh-highlands-heritage-railways-winter-volunteering-trip-2","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2020\/03\/03\/1199","title":{"rendered":"Ffestiniog and Welsh Highlands Heritage Railways Winter Volunteering Trip"},"content":{"rendered":"\n<figure class=\"wp-block-image alignfull size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"4396\" height=\"2931\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17.webp\" alt=\"\" class=\"wp-image-1200\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17.webp 4396w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-300x200.webp 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-1024x683.webp 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-768x512.webp 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-1536x1024.webp 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-2048x1365.webp 2048w\" sizes=\"auto, (max-width: 4396px) 100vw, 4396px\" \/><figcaption class=\"wp-element-caption\">Machynlleth Footbridge, signage in both Welsh and English. Interestingly every single symbol has been duplicated as well.<\/figcaption><\/figure>\n\n\n\n<p id=\"d44e\">I know it’s probably not the best idea to write a report in chronological order, but I do believe that presenting photos in chronological order facilitates my flashback process.<\/p>\n\n\n\n<p id=\"e279\">Our day started at London Euston, where we stepped aboard the Avanti West coast service to Birmingham new street. This was one week after the franchise was passed from Virgin Trains, when the Pendolinos had yet to be refurbished, with an oddly blank white-washed livery. There are still remnants of Virgin Trains’ 20 years of operation though, as you can tell from the “VT” prefixed train number.<\/p>\n\n\n\n<figure class=\"wp-block-gallery alignwide has-nested-images columns-default is-cropped wp-block-gallery-1 is-layout-flex wp-block-gallery-is-layout-flex\">\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1CJ2-ErZQslEu-aOkUXL31Q.webp\" alt=\"\"\/><\/figure>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1NRTaHbmkilg07GVOSmN6eA.webp\" alt=\"\"\/><\/figure>\n<figcaption class=\"blocks-gallery-caption wp-element-caption\">Avanti West Coast Pendolinos<\/figcaption><\/figure>\n\n\n\n<p>The next 2 photos were taken at Birmingham New Street.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1H5lyiC7T-2FJPm2-RwjnYg.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">London Northwestern service approaching Birmingham New Street<\/figcaption><\/figure>\n\n\n\n<p id=\"a527\">We arrived at Birmingham New Street at around 17:00, when it was starting to approach the evening peak. Our train to Wales was quite crowded as well, and it was worsened by the fact that our train was around 20 minutes late.<\/p>\n\n\n\n<p id=\"88b5\">The new national train timetable came a week after this, so hopefully National Rail\/ TfW did manage to somewhat reduce delays?<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1_8NqllxpZUz3CvvXoTQasw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Birmingham New Street Station Concourse<\/figcaption><\/figure>\n\n\n\n<p id=\"c430\">This photo was taken at a time when the carriage was relatively less crowded.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1lf08MoP_iMGrZqzl7sbpTw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Inside a TfW (Trafnidiaeth Cymru) Class 150\/2 Sprinter<\/figcaption><\/figure>\n\n\n\n<p id=\"0344\">On the topic of degrading train service quality, the shortcomings of the train were especially apparent under such heavy duty. Wind was sifting through the flimsy doors, and in between the window panes. Perhaps the train was never designed for this sort of intercity commuter service afterall.<\/p>\n\n\n\n<p id=\"7bf6\">And by the way, I think I’ve almost never seen a naked fluorescent tube before, at least on a train. The train was probably on its last legs, for decades.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1otmewbqJy-5XNNvlp2Zytw.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"94e6\">Meanwhile, as we approach Wales, say hello to bilingualism!<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1FrDKIxtC7OOf4wxmaa_qRQ.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"a7e8\">We later changed to another train at Shrewsbury (though it was supposed to be the same service) on to our last leg to Penrhyndeudraeth. As we went further into North Wales along the Cambrian Line, we basically were the only passengers left on the train.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_14N-WvGyqDKhIZnrYoR5jSw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Inside a deserted Class 158 Express Sprinter Carriage<\/figcaption><\/figure>\n\n\n\n<p id=\"ed83\">Upon arrival at Penrhyndeudraeth, we were kindly taken to the youth hostel along the heritage railway. More on that later.<\/p>\n\n\n\n<p id=\"3413\">And that was basically day one (technically we had a bit of night life afterwards).<\/p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-dots\"\/>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"0519\"><strong>The (steamed) bread and butter of the trip…….<\/strong><\/h1>\n\n\n\n<p id=\"3785\">As a rail enthusiast, I enjoy being on trains and observing their operations. And having spent most of my life in Hong Kong, I do not have a necessarily strong attachment to railways elsewhere in the world. That said, I have always looked forward to witnessing the grandeur of steam railways in the UK, as I’ve never been on steam trains before.<\/p>\n\n\n\n<p id=\"021d\">Here comes the steam train…….<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1roAao7nfpOP6BKIc8zq15w.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"5a62\">……..except the carriage is in front of the locomotive, which I guess kind of makes sense given that the train has been going uphill for the majority of its journey.<\/p>\n\n\n\n<p id=\"f614\">A closer inspection at its steamy glory.<\/p>\n\n\n\n<figure class=\"wp-block-image alignfull\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1T-EKHTADIgPfX4lpke3e6A.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"a1a7\">We then travelled down to the Boston Lodge Work where our volunteering work for the next two days took place. I have never went beyond outer London, let alone Penrhyndeudraeth in Wales.<\/p>\n\n\n\n<p id=\"49d1\">Indeed, it was a delight to start the day staring at the boundless sea. I can’t tell which direction we were facing, but perhaps we could have been able to see Ireland on a clear day if this photo was shot towards the west? Ireland is quite far though.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_17WAIiUKOqME1l2_RX3KJ3w.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"d3a6\">And it was an even greater delight to see the gorgeous mountains the whole time we were volunteering.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1vKV5lp9yBcR4PA5yTWPDwA.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"3627\">This is where my photo timeline starts to get a bit sparse, since we started the volunteering work.<\/p>\n\n\n\n<p id=\"0771\">It was a joy to see so many steam train locomotives, but the hands-on engineering experience was undeniably the best part of the trip. We got the chance to lay a couple tracks in the shed, which was kind of an exciting process since I thought rail instalments would all be done by heavy machinery nowadays. For many of us, it was also the first time we learnt the basic practical skills of usingrelatively primitive tools like crowbars and large aluminium tongs. At the end of the day, it was satisfying to see the pair of rails perfectly (or at least somewhat perfectly) aligned in parallel. I guess this is actually one of the few places were this kind of work is done manually, though the process is assisted by other tools at the end of the days to ensure a sufficient degree of precision. We were also instructed to install a few underground electrical cables, and it was somewhat interesting how wires were pulled through meandering underground tubes.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1CuYpUDmRTh3f40l1bRTs_A.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"6d50\">While most of the work we performed was not directly related to my electrical and electronic engineering studies, it was the first time where I experienced engineering in a work-place environment. I also saw how different volunteers utilise knowledge from different disciplines to optimise and to increase the efficiency of maintenance within the shed.<\/p>\n\n\n\n<p id=\"2e96\">Speaking of efficiency, we were kind of halted by a sudden brief moment of hail on our second day of volunteering, which I had never experienced before.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1mwUPRCtfVL4rq0LKbBzGJA.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">The lonely carriage in the hail.<\/figcaption><\/figure>\n\n\n\n<p id=\"9e67\">But the gorgeous views at the other times of the day never cease to awe you.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1GuRCBpu3LQ1K8ilotQmXHg.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Sunset!<\/figcaption><\/figure>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-dots\"\/>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"e258\">Down Time<\/h1>\n\n\n\n<p id=\"8dca\">The down time we had after hours of labourious work was fulfilling as well. During our (hard-earned) tea time, we had a wonderful time conversing with experienced volunteers; they talked quite a bit about their volunteering experience at the Ffestiniog Railway as well as the history of the country’s railway. While I haven’t really witnessed the golden age of British Steam Railways, I can see why Steam Railways is seen as an integral part of the country’s heritage and culture; it is an embodiment of how far the railway industry has evolved in the past few centuries.<\/p>\n\n\n\n<p id=\"d286\">On the other hand, a fun down game that we played during the evenings was the GWR game.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1Kka4u30TZ-E2Y1llE9HRLw.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"7339\">The game is in many ways like monopoly, but with a gameboard design specifically tailored to the GWR network. The aim of the game is to collect as many points as possible, where each station is worth 1 point. Collecting all stations in a set triples the amount of points, though it should be noted that stations in a set are not in close proximity at all.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1ze9ImgDX3oUreeQNFLszrw.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"e12e\">At the start of the game, each player is given a set of cards, in which the first card determines the starting point of the player. Throughout the game, one collects as many stations as possible. At the end of the game, the player who reaches London Paddington the fastest collects an extra 10 points.<\/p>\n\n\n\n<p id=\"1409\">Unlike monopoly, the game appears to require less luck in that there is not a dice involved; you can move at most 9 stops along the mainline (red), 6 stops along other electrified lines (grey), or 3 along the non-electrified lines (black), though you must always stop at a junction (star). If you stop at an unclaimed station, you gain the card; if it is owned by another player, you surrender one of your cards. The most exciting thing is when we get to exchange cards and carry out negotiations in the middle of the game……<\/p>\n\n\n\n<p id=\"76cd\">We arguably learnt quite a bit more about the history of the Great Western Railway, and it sparked many funny and insightful discussions throughout. A few of us even proposed creating a tube version of this game, and I’m very much looking forward to that!<\/p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-dots\"\/>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"0f1a\">Departure<\/h1>\n\n\n\n<p id=\"22c5\">The sky was visibly cloudy the day we had to leave. Maybe we were allfeeling sad that we had to leave such a wonderful place…….(awww)<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1GoPQzmqeqQWAUI-d3K592w.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">A view of the small town of Penrhyndeudraeth.<\/figcaption><\/figure>\n\n\n\n<p id=\"cf09\">We passed by Dovey Junction, a station that we were constantly talking about when were playing the GWR game. It’s called a junction but it is located at an inconvenient location. It is where the Cambrian line splits into the line to Aberystwyth and the Cambrian Coast Line to Pwllheli.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1dyyG86hFQsFErHU2Z5qSqw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Dovey Junction<\/figcaption><\/figure>\n\n\n\n<p id=\"dc4c\">Interestingly, it appears as if it is isolated in the midst of nowhere, with a single island platform that does not seem to be accessible given that theere are tracks at both sides of the platform.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1YNKuHRbU_VLeeIOkdvMnXg.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">The island platform at Dovey Junction.<\/figcaption><\/figure>\n\n\n\n<p id=\"d811\">However, according to TfW statistics, 4622 people use the station anually, and 9321 use the station for interchanges. It is unclear how TfW collects this data, and honestly I just wouldn’t want to be stranded at such an isolated station.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_18Q3all9w3dvSoFE4l739Zg.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">The Class 158 Express Sorinter.<\/figcaption><\/figure>\n\n\n\n<p id=\"eaf0\">With so many journeys undergone everyday, the train undestandably regularly suffers quite a bit of wear and tear. This is especially apparent due to its white livery. The windows are extremely murky as well.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1HH17h-QnW8kHxA61ytaoMA.webp\" alt=\"\"\/><\/figure>\n\n\n\n<p id=\"9ea4\">Those of you with keen eyes (hopefully most of you) would notice that there is an oddly crystal clear window amongst the murky array of windows. You may wonder why that is the case.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1PKTDxE7nEWIR0aL5OfqmCw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">The oddly clean window amongst.<\/figcaption><\/figure>\n\n\n\n<p id=\"9e65\">Contrary to what some of you may think of rail enthusiasts, rail enthusiasts like trains not only for the experience of being in a train itself, but also for the experience of witnessing gorgeous, or sometimes even picturesque landscapes along the way. Indeed, one side of the train was always facing the sea (which might have allowed us to see Ireland on a super clear day?!). On the bright side, this means a boundless view for passengers throughout a large segement of the trip. Nonetheless, this also means that it is constantly exposed to the moisture, or more specifically the salinity of the sea water, which leads to the accumulation of salt on the windows. This actually significantly reduces the visibility of the windows.<\/p>\n\n\n\n<p id=\"9820\">Our window was particularly murky, so we rushed out to wipe our window at the first moment the train arrived at the next spot. With diet coke. Which does make sense cause the acid in the coke effectively removes the salt accumulated on the windows, and we weren’t finishing our coke anyways. The train guard saw this and gave us an eye of approval when we were heading out to clean the window. She also helped us to find the station which the train would stop long enough for us to clean the window successfully.<\/p>\n\n\n\n<p id=\"e6b9\">Now that I look at this photo, I wonder what the cleaners or train presentation managers thought when they saw this oddly clean window. With contentment or bewilderment?<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1_1264FFU3HzUYKkBafmUT7UQ.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Our Class 221 Super Voyager arriving at London Euston.<\/figcaption><\/figure>\n\n\n\n<p id=\"6e42\">After a fairly uneventful journey which we spent playing cards most of the time, we finally arrived at London Euston.<\/p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-dots\"\/>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"dfe3\">Closing (train of) thoughts<\/h1>\n\n\n\n<p id=\"3c6a\">This was an experience beyond an enthusiast activity. Working alongside my passionate peers from the Rail Society as well as experienced volunteers from the Ffestiniog Railway was satisfying.We developed a closer bond with the country’s railways, and also strengthened our cross-generational ties with experienced veterans of the rail industry.<\/p>\n\n\n\n<figure class=\"wp-block-image alignfull\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/12KiEKs-AEsp4juWKbufQuw.webp\" alt=\"\"\/><figcaption class=\"wp-element-caption\">A view from the footbridge of Machynlleth Station<\/figcaption><\/figure>\n\n\n\n<p id=\"4249\">I found the trip very rewarding, and if given the opportunity, I look forward to participating in this again in the future!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I know it’s probably not the best idea to write a report in chronological order, but I do believe that presenting photos in chronological order facilitates my flashback process. Our day started at London Euston, where we stepped aboard the Avanti West coast service to Birmingham new street. This was one week after the franchise [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1200,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2,33],"tags":[38,17,35,20,36,34],"class_list":["post-1199","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","category-railways","tag-diesel","tag-photography","tag-steam","tag-travel","tag-volunteering","tag-wales"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/image-17-1024x683.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/1199","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=1199"}],"version-history":[{"count":2,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/1199\/revisions"}],"predecessor-version":[{"id":1261,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/1199\/revisions\/1261"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/1200"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=1199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=1199"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=1199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}