{"id":374,"date":"2018-11-25T10:27:15","date_gmt":"2018-11-25T10:27:15","guid":{"rendered":"http:\/\/yanni-test-localwp.local\/?p=374"},"modified":"2024-01-24T21:17:38","modified_gmt":"2024-01-24T21:17:38","slug":"urban-microclimates-how-have-our-activities-changed-them","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2018\/11\/25\/374","title":{"rendered":"Urban Microclimates &#8211; how have our activities changed them?"},"content":{"rendered":"\n<p>Urban microclimates refer to the small variations in weather and climatic conditions within a compressed, dense urban environment. Human activity occurs in many forms and they affect the microclimates of different regions to different spatial and temporal extents. With respect to two case studies, namely the urban heat island effect created by dense buildings in Hong Kong, and the commencement of the London Olympics in 2012, this essay discusses the varied effects of human activity on urban microclimates.<\/p>\n\n\n\n<p>Urban heat island effect refers to the concept of a metropolitan area being significantly warmer than its surroundings. Urban Hong Kong is known for its urban heat island micro-climate; the temperature difference between rural areas and down town can reaches 4oC in summer or 6.5oC in winter.<\/p>\n\n\n\n<p>For instance, there is a canyon environment created by tall buildings in urban areas which traps heat; often times, this is intensified with the existence of impervious surfaces such as concrete and asphalt. These structures release a great amount of stagnant pollutant gases at street level that radiates heat, and they contribute to decreased wind flow in between these structures; given that these structures are mostly clustered in and near the inner city, like Yau Tsim Mong where development is mostly unplanned and highly concentrated, the heat island effect is intensified in that region.<\/p>\n\n\n\n<p>From a temporal perspective, it is intensified with the incidence of other human activities like traffic congestion during both morning and peak hours; this is especially evident in morning peak hours where the typical departure time of students coincide with that of the typical 9to5 worker; consequently, this causes the effect to be worsened in these hours. It can be seen that, while the urban environment itself is the main cause for this hotter microclimate, this hotter microclimate is in fact intensified with human activities that are related to the economy and the flow of goods and people within the city.<\/p>\n\n\n\n<p>From this perspective, it is arguable that, while not all human activities in the urban area initiates the urban heat island effect, most play a role in worsening a microclimate that is increasingly hot, to different extent for different regions of the urban areas and for different temporal contexts.<\/p>\n\n\n\n<p>On the other hand, the London Olympics in 2012 shows a different kind of effect of human activity on urban microclimate; the following paragraph explores the effect of microclimate due to the secondary effects of the Olympics in the Greater London region.<\/p>\n\n\n\n<p>One of the most significant short term effect is air pollution across various airports in London, due to the significant 35 percent increase in passengers, goods and freight; many of these passengers are spectators for the games, and many of these resources goes towards retail at the Olympic Village. The short term effect is a minor 0.5 percent increase in cloud cover at Heathrow Airport during the games, when compared with summers of previous years.<\/p>\n\n\n\n<p>However, it is undeniable that this may also be a result of global warming or other fluctuating climatic conditions. Nonetheless, albeit the short period of the effect, the magnitude of the effect is significant on creating a differed urban microclimate near the airport. While it is seen as a short-term event, many of the other effects are in fact long term or permanent due to the massive nature of the event as well as the spatial influence of the event.<\/p>\n\n\n\n<p>For instance, one of the projects of the expansion of London Overgrounds East London Line as well as upgrades to the Docklands Light Railway; these trains run on diesel and contributes to a large amount of polluting gases released along the railway lines and leads to the creation of spheres of light smog near the stations. This form of light smog is lightly due to the air pressure difference created by the incident of cool air breezes on stagnant pollutants in the air near the railway.<\/p>\n\n\n\n<p>In conclusion, it can be seen that human activity can have both short term and long term effects, that are of different magnitude, and temporal and spatial distribution. And extended exploration on the positive impacts of human activity would add an extra perspective to the essay and provide a response that is even more wholistic.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Urban microclimates refer to the small variations in weather and climatic conditions within a compressed, dense urban environment. Human activity occurs in many forms and they affect the microclimates of different regions to different spatial and temporal extents. With respect to two case studies, namely the urban heat island effect created by dense buildings in [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":505,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[3],"tags":[10,11,12,15],"class_list":["post-374","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-geography","tag-geography","tag-hong-kong","tag-ib","tag-london"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2023\/08\/YanToChau_Contradictions_HK-1024x768.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/374","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=374"}],"version-history":[{"count":1,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/374\/revisions"}],"predecessor-version":[{"id":506,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/374\/revisions\/506"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/505"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=374"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}