{"id":708,"date":"2022-02-04T21:07:00","date_gmt":"2022-02-04T21:07:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=708"},"modified":"2025-08-14T21:38:29","modified_gmt":"2025-08-14T21:38:29","slug":"going-solo-means-going-for-solos","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/04\/708","title":{"rendered":"Going solo means going for solo&#8217;s"},"content":{"rendered":"\n<figure class=\"wp-block-image alignwide size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058179-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-710\"\/><\/figure>\n\n\n\n<p id=\"07fa\">The best thing about travelling solo is that you have all the flexibility you can possibly have. For instance, while an enthusiastic me from a couple weeks ago decided that I would regret not maximising my first day in Bath, the lazy me from that morning decided that I would like to catch a couple hours of sleep and take a later train. Besides, I could take advantage of the cheaper off-peak tube fare to Paddington. Or at least that’s what I tell myself to justify this laziness.<\/p>\n\n\n\n<p id=\"c33d\">So instead of boarding the 09:30 train I had originally reserved a seat for, I boarded the 10:30 from Paddington. Which was, to be fair, not too much of a delay by British standards. But if my ticket was an advanced (rather than anytime off-peak) one, I could have easily combatted my laziness.<\/p>\n\n\n\n<p id=\"fcda\">Anyways, by the time I had arrived at Bath it was noon. Normally I would have, without a doubt, started my day from there, as I wouldn’t have been able to check in early at a hostel. But since I had my skates with me I dropped my bags off at the hostel first. This was planned. (The £2 locker cost was not planned however.)<\/p>\n\n\n\n<p id=\"c465\">As a clueless solo traveller, I reckoned I should search for the “best restaurants in Bath”. Afterall I was likely going to spend the night at the bar, so I might as well probably treat myself well for my first lunch. On TripAdvisor, Sally Lunns came along as the top option, as the food is supposedly nice, and the building is one of the oldest in Bath, dating back to 1842. The images of the food did not look particularly special, but I believe in reviews and review ratings — which is sometimes a bad idea because I end up going for “mainstream” stuff.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057737-2-959x1024.jpg.webp\" alt=\"\" class=\"wp-image-711\"\/><figcaption class=\"wp-element-caption\">Sally Lunns from 1680!<\/figcaption><\/figure>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"5872\">Queues<\/h1>\n\n\n\n<p id=\"c1e1\">I normally hate queues, but seeing as I was solo travelling, I reckon I could get a table much faster than usual.<\/p>\n\n\n\n<p id=\"95d3\">I could not be more wrong.<\/p>\n\n\n\n<p id=\"a8df\">I spent more than 20 minutes waiting in queue. This brings me us to the juiciest (or at least relatively jucier) part of the story.<\/p>\n\n\n\n<p id=\"ef71\">At the queue, there was a couple in front of me, and a group of tourists behind me, consisting of four ladies and one guy. Two of the ladies in the group had a particularly distinct American accent.<\/p>\n\n\n\n<p id=\"0ebf\">I have now been standing alone for more 10 minutes. I’ve never (or at least rarely) noticed before, but it just feels odd when everyone around you is happily immersed in pretentious conversations about Bath’s heritage or whatever. Obviously this is not the kind of restaurant friendly to solo travellers. In fact it’s the exact opposite — a tourist honeypot that caters specifically to familes and couples. I felt stupid and wondered why I had chosen a place like this for lunch. I was about to leave.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057933-1024x768.jpg.webp\" alt=\"\" class=\"wp-image-712\"\/><\/figure>\n\n\n\n<p id=\"bb41\">That was when somthing rather unexciting happened that somehow changed the course of this story. The four ladies decided to take a walk around while the guy stood in line. Naturally the guy turned to me for a conversation.<\/p>\n\n\n\n<p id=\"721c\"><em>“Hiya. You’re travelling with your family?”<br>“Yeah. Where are your friends?”<br>“No. I’m solo travelling. In fact, it’s my first time doing so in the UK”.<br>“Ah that’s brilliant!”<\/em><\/p>\n\n\n\n<p id=\"3e08\">And that initiated our 15 minute conversation. I learnt that Dave (fictitious name) is a lecturer of Biochemistry at Durham university, currently spending the Christmas with his family and American relatives in Portsmouth. Naturally I began asking him about his scope of work, and gradually we gravitated towards talking about the recent UCU strike. In general, I observed that more entry level staff, such as teaching fellows, were much more likely to strike than senior staff, such as professors. He politely agreed, and immediately explained that he had just started this position in January 2021, so at the moment he has yet to develop a clear stance on the issue of pensions and other rights. I explained that If I were in his position I would have been extremely frustrated. He responded simply by saying that he enjoys his work.<\/p>\n\n\n\n<p id=\"6910\">I guess it’s his passion and dedication to teaching and research that keeps him moving. But if I were a local student or taxpayer, I still would not be able to see how the reduction in pensions can be justified by the government and universities, considering that the UK heavily relies on higher education for its economy.<\/p>\n\n\n\n<p id=\"13df\">That was when the ladies returned, and so the conversation ended.<\/p>\n\n\n\n<p id=\"a35a\">In retrospect the conversation was pretty tasteless. The main point, I realised, as a solo traveller, was that I needed to actively look for and converse with other solo travellers. Somehow it’s way easier to approach a solo traveller than to approach people in a group.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>How have I not noticed that prior to all this?<\/p><\/blockquote><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058310-cropped-836x1024.jpg.webp\" alt=\"\" class=\"wp-image-713\"\/><\/figure>\n\n\n\n<p id=\"169c\">And so I kept this in mind for my next few days. A pretty uneventful but influential start for my solo trip.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The best thing about travelling solo is that you have all the flexibility you can possibly have. For instance, while an enthusiastic me from a couple weeks ago decided that I would regret not maximising my first day in Bath, the lazy me from that morning decided that I would like to catch a couple [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":710,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2,8],"tags":[29,30,20],"class_list":["post-708","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","category-travel","tag-bath","tag-solo-travel","tag-travel"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058179-1024x683.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/708","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=708"}],"version-history":[{"count":2,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/708\/revisions"}],"predecessor-version":[{"id":714,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/708\/revisions\/714"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/710"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=708"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=708"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=708"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}