{"id":718,"date":"2022-02-04T21:19:00","date_gmt":"2022-02-04T21:19:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=718"},"modified":"2025-08-14T21:38:29","modified_gmt":"2025-08-14T21:38:29","slug":"contemporary-persuasion-1-a-quick-but-succinct-burn","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/04\/718","title":{"rendered":"Contemporary Persuasion 1: A quick but succinct burn"},"content":{"rendered":"\n<p id=\"4c56\">his is a painstakingly long journal, disguised as a cute photograph-filled blog, that describes two acquaintainces (friends) I’ve spent the most time with during (and after) the trip. In fact, these two radically interesting hostel-mates are probably the reason I am not discouraged from making any more solo travel trips in the future!<\/p>\n\n\n\n<p id=\"3ef3\">But the things happening in this journal are all present continuous. So for the sake of maintaining a certain degree of privacy for myself and these two acquaintainces, I fear that certain names (or even places, items or incidents) mentioned in this blog have been shamelessly altered from their original form, by my unimaginative imaginations.<\/p>\n\n\n\n<p id=\"ba19\">So acknowledge the somewhat fictitious nature of this piece, albeit the fact that it is indeed based on my real encounters, and we shall begin.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057806-1024x768.jpg.webp\" alt=\"\" class=\"wp-image-719\"\/><figcaption class=\"wp-element-caption\">Great Pulteney Street<\/figcaption><\/figure>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"\/>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"c6fe\">Good evening<\/h1>\n\n\n\n<p id=\"d4ea\">Exhausted with reading the crappy stack of outdated quiz-cards with the three girls I met at the bar, I dragged myself towards my bedroom. It was fun, but all that reciting just seemed a slight bit out of place for what was supposed to be a fast-paced game. Anyhow the questions just probably weren’t very amusing.<\/p>\n\n\n\n<p id=\"a9c1\">9 planets in the solar system? Get over it.<\/p>\n\n\n\n<p id=\"6597\">While I was finding myself lost in the confusingly signposted corridors, I realised that up until this moment I have yet to see my room-mates, because I have been out all night. I quickly recalled what I last saw in my bedroom. Three sets of double bunk beds, with double-glazed windows in between them. Curtains shut. Slightly dusty storage racks beneath the lower bunk beds. All unoccupied and untouched.<\/p>\n\n\n\n<p id=\"2058\">Not very helpful.<\/p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"c056\">A quick but succinct burn<\/h2>\n\n\n\n<p id=\"15f8\">So I stepped into my bedroom, and before the overhead door closer gradually closed the door I was immediately greeted, or rather, confronted, by this desperate guy sitting on his left lower bunk bed, who immediately spoke,<\/p>\n\n\n\n<p id=\"d756\"><em>“Hello. What’s your name?”<\/em><\/p>\n\n\n\n<p id=\"645d\"><em>“Yanni.”<\/em><\/p>\n\n\n\n<p id=\"238b\"><em>“Where are you currently from?”<\/em><\/p>\n\n\n\n<p id=\"55d2\"><em>“London.”<\/em><\/p>\n\n\n\n<p id=\"f123\"><em>“Where are you actually from?”<\/em><\/p>\n\n\n\n<p id=\"cdcc\"><em>“Hong Kong.”<\/em><\/p>\n\n\n\n<p id=\"c65e\"><em>“Ah okay. So what are you currently studying?”<\/em><\/p>\n\n\n\n<p id=\"f89c\"><em>“Electrical Engineering at Imperial College London Year 3.”<\/em><\/p>\n\n\n\n<p id=\"96ed\">Alright. I will have to admit, the way I articulate this doesn’t really reflect the interogative nature of our first conversation. But the way this cryptical man, whom I later know is called Arjun, starts the entire conversation without any pleasantries, just seems rather abnormal. I would go as far as saying that it’s very dissimilar to the way I’ve come to know any friend or person. But I like this. Curiously, he continued,<\/p>\n\n\n\n<p id=\"9f8a\"><em>“That’s a nice school (or maybe this is just what my manipulative mind tells me to remember). How much school fees do you pay annually?”<\/em><\/p>\n\n\n\n<p id=\"6a19\">“…….” (It’s an open secret, so check it online.)<\/p>\n\n\n\n<p id=\"7b85\"><em>“Holy shit. How much do your parents make anually?”<\/em><\/p>\n\n\n\n<p id=\"ad4b\">I gently closed my widening mouth and gulped.<\/p>\n\n\n\n<p id=\"9ded\"><em>“That’s private. I never disclose my family finances. Why should I tell you?”<\/em><\/p>\n\n\n\n<p id=\"d51e\"><em>“I tell you why.”<\/em><\/p>\n\n\n\n<p id=\"ec18\">And he embarked on a five minute non-stop speech, lecturing me about my financially unsustainable lifestyle, and that I would be spending the rest of my life trying to recouperate for my university education. Or that if I’m able to recouperate the amount I would probably be utilising skills from experiences elsewhere, not from an overglorified entrance pass that “teaches me nothing”. Besides, competitive universities in the United States are where the intellectually superior (I will have to clarify that these are not my words) meet, and European universities offer significantly cheaper (if not free) higher education and way more scholarships. Both of which (he claims) I have probably not been smart enough to attain.<\/p>\n\n\n\n<p id=\"82db\">Ouch.<\/p>\n\n\n\n<p id=\"a40f\">Ouch but prolly true.<\/p>\n\n\n\n<p id=\"7b80\">When I contemplate upon these intricate topics, I tend to think that I have applied to, and have been accepted to Imperial College for a good reason. And all things considered, I do not think these opportunities lend themselves to me. (Not that opportunities shall lend themselves to me because opportunities should be actively pursued for.) To be fair, you even mentioned that Bill Gates did not quit university to become successful; he quitted university because he was determined to work on something to be successful.<\/p>\n\n\n\n<p id=\"368e\">From this perspective, I am in a fortunate position to be lost at this moment, so as to search for my determinations after university. In any case, I am a stubborn supporter for well-established systems and I accept, but not particularly worship, change.<\/p>\n\n\n\n<p id=\"e5b1\">Okay.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058073-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-720\"\/><figcaption class=\"wp-element-caption\">Fashion Museum Bath<\/figcaption><\/figure>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"0905\">Gently sailing<\/h2>\n\n\n\n<p id=\"16eb\">For god knows how long we tediously revolved about the downfalls of British education (to be honest it’s specifically my education and the debatable decisions I’ve made), before he then went on a full-on diss on how the British government runs by nothing but international student tuition, which is why it has no money for the NHS and free television licenses for its citizens.<\/p>\n\n\n\n<p id=\"2c79\">Strangely, our conversation revolved around television for quite a while, as he found it rather absurd that people from India have multiple TV’s at home, whereas the British all gather around a couple small TV’s at pubs just to watch a football match.<\/p>\n\n\n\n<p id=\"bc48\">Unfortunately, I do not have much to say about this. As a Gen Z, I grew up with television, but throughout my teenage years I have gradually distanced myself away from television — though probably not due to smartphones because I only started having one 5 years ago. So probably with a mixture of political and peer influencing reasons, I do not have the same degree of desire for television.<\/p>\n\n\n\n<p id=\"3e1a\">But now that I think about this issue, it does seem rather backwards. In fact he argues that it is emblematic of the Brits’ socioeconomic and cultural decline — every single city in the UK, perhaps except London and a couple other larger cities, rely on either university students or heritage tourism (or in his perspective, “lies”), for a living. And in his own words, people are not intellectually capable enough to elect effective leaders, which is why London is mostly (or at least financially) run by Indians and Asians. I’m not a banker or a bright startup CEO or an industry expert so I cannot comment on this.<\/p>\n\n\n\n<p id=\"ccf7\">But baffingly we’re both in Bath, a British town that very much capitalises on tourism and university students for its survival.<\/p>\n\n\n\n<p id=\"70fb\">Regardless, I still, to this point, find the country very charismatic as a whole. Perhaps I haven’t lived long enough to make up my mind yet. But I do think the country is a great spring board towards other destinations in Europe — which makes me slightly regret my decision to give up German Level 2.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057864-1024x577.jpg.webp\" alt=\"\" class=\"wp-image-721\"\/><figcaption class=\"wp-element-caption\">The Holbourne Museum<\/figcaption><\/figure>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"\/>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"13a3\">Revealing more cards<\/h2>\n\n\n\n<p id=\"8665\">Up until now I thought that Arjun was 25 or so — the way he giggles and speaks misrepresents him. No offence (although it’s obvious that I know what I am about to say is offensive) but he giggles like a spoilt girl in a show like Love Island. It’s ironic because I remember him saying that a smile is supposed to come from your heart not your mouth.<\/p>\n\n\n\n<p id=\"3920\">Anyways, he later revealed that he is 35, and that he works as a part-time lawyer (more like a law consultant) and as a full time lecturer at a University in London.<\/p>\n\n\n\n<p id=\"5018\">Oh.<\/p>\n\n\n\n<p id=\"6499\">So this explains why he has such elaborate insights into the higher education system in both Europe and the Americas, as well as the political climate that shapes these systems currently. And I guess this is why he’s used to talking to people in a rather interrogative and assertive tone — though once again I love this because the Brits rarely make their intentions clear in daily conversations, which makes it extremely exhausting to interpret their intentions.<\/p>\n\n\n\n<p id=\"170f\">This is all a bit funny because he is raised by this system (at least to some extent) and a successive product of this system. Or at least that’s my impression as of right now.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058134-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-722\"\/><figcaption class=\"wp-element-caption\">The Circus<\/figcaption><\/figure>\n\n\n\n<p id=\"274c\">Of course there were a lot more gossipy conversations regarding our trips, but besides that (and many other things I shall not speak of in my blogs) this is all I remember of. And before I realised it has already been nearly an hour since we’ve talked.<\/p>\n\n\n\n<p id=\"9671\">So I took a shower and flooded the entire bathroom.<\/p>\n\n\n\n<p id=\"1080\">Not the worst way to start my first night at Christopher’s, but hopefully no one finds out that it was me.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>his is a painstakingly long journal, disguised as a cute photograph-filled blog, that describes two acquaintainces (friends) I’ve spent the most time with during (and after) the trip. In fact, these two radically interesting hostel-mates are probably the reason I am not discouraged from making any more solo travel trips in the future! But the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":720,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2],"tags":[29,17],"class_list":["post-718","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","tag-bath","tag-photography"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058073-1024x683.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/718","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=718"}],"version-history":[{"count":2,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/718\/revisions"}],"predecessor-version":[{"id":724,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/718\/revisions\/724"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/720"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=718"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=718"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=718"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}