{"id":725,"date":"2022-02-11T21:29:00","date_gmt":"2022-02-11T21:29:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=725"},"modified":"2024-01-24T22:25:46","modified_gmt":"2024-01-24T22:25:46","slug":"contemporary-persuasion-2-tea-9999-steps-reflections","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/11\/725","title":{"rendered":"Contemporary Persuasion 2: Tea + 9999 Steps + Reflections"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-1024x683.jpg\" alt=\"\" class=\"wp-image-726\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057752-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">A twist at North Parade<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"d526\">Good morning<\/h1>\n\n\n\n<p id=\"dc86\">It was nine o’ clock. Gotta grab something before the hostel breakfast ends at nine thirty.<\/p>\n\n\n\n<p id=\"26d4\">More context —the hostel offers “continental breakfast”, and whatever kind of splendid food you associate it with, it’s just an overglorified name for cereals, toasts and fruits. Maybe ham as well if you’re an early bird, but that’s it. Worst of all, you pay £4 for it, which, in contrast, easily gets you a freshly baked crossaint and hot chocolate from the cute café across the street. In fact, when I first arrived at the breakfast room I thought more was coming, or that there was an isle of food hidden somewhere.<\/p>\n\n\n\n<p id=\"f1f7\">Anyways I’m a sheep, and because my room-mates were heading there I might as well chug whatever there was available on the table. So I chugged three pieces of toast into the toaster.<\/p>\n\n\n\n<p id=\"7bfa\">I must have stared at the red hot metallic rails of the toaster for a couple minutes, because my eyes were starting to water.<\/p>\n\n\n\n<p id=\"bfc2\">No, my stomach was about to rumble. But still nothing came out.<\/p>\n\n\n\n<p id=\"03fe\">Here comes a drowsy girl who was about to chug her toast into the oven. And so I stopped her,<\/p>\n\n\n\n<p id=\"d3d9\"><em>“Do you know how to operate this toaster?”<\/em><\/p>\n\n\n\n<p id=\"abb6\"><em>“No.”<\/em><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-1024x683.jpg\" alt=\"\" class=\"wp-image-727\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057760-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Pulteney Bridge<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"d34f\">The Mongolian girl<\/h2>\n\n\n\n<p id=\"480f\">And that was how I came to start a conversation with Nas, a person whom I’ve somehow managed to spent the next two days with. With Arjun of course. I do not find this conversation particularly remarkable, but Nas thinks that it was clearly a funny and desperate attempt to start a conversation. Regardless, I was genuinely confused about operating the toaster, and the toast from the other toaster was not good.<\/p>\n\n\n\n<p id=\"2826\">I laid my plate and bowl of cereal on the table, and she sat beside me. We started a conversation. She’s from the tough nation of Mongolia (although I’ve already implied this from the section subtitle), and is currently a Finance Masters student at Norwich. At a first glance, she looks like she’s 22 or 23. Or somewhere near my age.<\/p>\n\n\n\n<p id=\"eb58\">That was when we started to discuss our plans for the day. I wanted to go to the Roman Baths. So did Arjun. So did Nas. And so we booked a slot for the Roman Baths in the evening.<\/p>\n\n\n\n<p id=\"e9f5\">That morning I went to the Fashion Museum and scrutinised upon the weird fashion tastes of our ancestors. More on that in another blog.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1443\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-scaled.jpg\" alt=\"\" class=\"wp-image-728\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-scaled.jpg 2560w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-300x169.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-1024x577.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-768x433.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-1536x866.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058389-2048x1154.jpg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"5304\">Tea + 9999 steps + Reflections<\/h1>\n\n\n\n<p id=\"48eb\">Bythe time we’ve stepped out of the Roman Baths the sky was dark. Just like any other typical British December day: cold, short and dark — like my life (no!). And it was drizzling. Just very gently though. And so the three of us strolled through the damp streets and its reflective puddles.<\/p>\n\n\n\n<p id=\"1a42\"><em>“Let’s get a coffee.”<\/em><\/p>\n\n\n\n<p id=\"3e91\"><em>“Okay.”<\/em><\/p>\n\n\n\n<p id=\"9d24\">To be fair I don’t drink coffee, so I wore a pretty cringey smile on face. I don’t think he noticed because I abuse that smile a bit too much. Anyways, he continued,<\/p>\n\n\n\n<p id=\"a5a2\"><em>“Scientist boy — you know where there’s coffee?”<\/em><\/p>\n\n\n\n<p id=\"0969\"><em>“Let me go on Google Maps and see what we have”.<\/em><\/p>\n\n\n\n<p id=\"1295\">It was roughly five fourty, and so many cafés were about to close. Luckily a Costa was open till 18:30. Or so I thought, until we arrived and saw the rows of chairs flipped on the tables. Visibly annoyed, Arjun joked,<\/p>\n\n\n\n<p id=\"9b55\"><em>“This is useless.”<\/em><\/p>\n\n\n\n<p id=\"7f32\">Or maybe he must have said “you’re useless”, but my mind is manipulating me right now.<\/p>\n\n\n\n<p id=\"50f6\">Anyways, this is the reason Arjun started calling me “scientist boy” — I have been abusing Google Maps way too much. Evidently the many searches I’ve made were useless, to the extent where I’ve completely abused his trust. So the nickname “scientist boy” must have started with some degree of contempt, combined with his perpsective as an artist\/ philosopher\/ lawyer etc. However, in my defence the only reason the search results were invalid was because we were stuck in between the two most overhyped holidays of the year.<\/p>\n\n\n\n<p id=\"ef42\">Eventually, after meandering around the same few streets for a couple times (in additional to the five or six times I did during the day, considering that Bath is a pretty small city) we decided to have coffee at an “Asian” Restaurant called Bongy Bo.<\/p>\n\n\n\n<p id=\"d155\">This scene must have seemed rather comical to our waiter, because she gave us a weirdly uneasy smile the whole time. A questionable combination of three juvenile looking teenagers (this is a complement) heading to an Asian Restaurant that serves anything but authentic Asian food, for coffee, at an uncanny hour for coffee, or in my case, just tea. What are the odds?<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-1024x683.jpg\" alt=\"\" class=\"wp-image-729\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058376-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"0a49\">Smoky misty stuff<\/h2>\n\n\n\n<p id=\"b5bf\">We chose a patio table in the outdoor courtyard, one of the many tables neatly lined in pairs, each with a large black umbrella above them. Further back in the courtyard was a furniture store, as well as another charming artisan coffee that was unfortunately closed. The restaurant itself sits in the courtyard, with quite a bit of indoor seating.<\/p>\n\n\n\n<p id=\"2975\">We quickly flipped through the menu’s and ordered two peppermint teas, a breakfast tea (though it was evidently dinner), and two satay chicken skewers.<\/p>\n\n\n\n<p id=\"09dd\">As soon as the skewer arrived I devoured the first piece. It tasted a bit too salty. Though I would say it perfectly complements the gradually intensifing conversations.<\/p>\n\n\n\n<p id=\"e607\">And so gradually Nas unfolds her identity. 27. A mother of 2 sons. A successful businesswoman, owning a chain of hair and nail salons in Mongolia.<\/p>\n\n\n\n<p id=\"7c24\">Her identity is eye opening to me for several reasons. First of all, I thought she was an undergraduate (though she is currently a Masters student). Secondly, I’ve never interacted with anyone from Mongolia before, and to me the landlocked country is an exotic mysterious void between Russia and China that we somehow often overlook. Thirdly, I didn’t know people nowadays still marry at such a young age. Finally, I’ve never personally spoken to someone with such determination — whether it be career aspirations or for life in general!<\/p>\n\n\n\n<p id=\"aac3\">As she spoke she pulled a cigarette out of her pocket and smoke started magicially puffing out of her mouth. Of course I know how this works — I just don’t find any thing about smoking gratifying, in a poetic or physical sense. Physically, the smoke makes me queasy, and poetically smoke is just smoke — nothing more than that.<\/p>\n\n\n\n<p id=\"81f0\">That said I don’t think I’ve personally spoken to any one who has smoked before, which says quite a bit about the depressingly narrow range of people I normally meet day-to-day.<\/p>\n\n\n\n<p id=\"6ef5\">I guess this was when Nas must have gotten a bit stressed out. Thus Arjun starts a long winded conversation about his own romantic encounters — he begins by bragging about regularly hit on by his female students, which is not surprising considering that I’ve mistakedly thought he was 25. Then he travels around the globe. Not literally, but by recounting all the romantic experiences, or more appropriately casual encounters, he has had with people, from Russia, France, Romania and so many more places. And those are smart people, like actresses, physics professors and more. And to the hawk eyed reader, yes, I wrote “people” because he mentioned about being chased by a tomboy in Thailand, which makes the entire story so much more amusing.<\/p>\n\n\n\n<p id=\"a4be\">Initially I thought he was bluffing. But based on the fact that his Instagram and LinkedIn Profile (sadly this is where we connected first) is connected to so many “blue-tick” or “verified” users I could see how this is real.<\/p>\n\n\n\n<p id=\"e8c3\">I do not have the luxury to fully comprehend this, but this is fine because I reckon the likelihood of me running into these situations are pretty low.<\/p>\n\n\n\n<p id=\"7a30\">Ironically, he has also previously dated a famous actress for 13 years, since 2006.<\/p>\n\n\n\n<p id=\"c704\">What?<\/p>\n\n\n\n<p id=\"9145\">To me this just seems heart-breaking. Obviously the casual encounters were meant to be fragile, but the actress and him must have dated so long for a good reason.<\/p>\n\n\n\n<p id=\"7b06\">That kept me silent for a few moments, so to distract myself I reached and fiddled with the battery operated candle.<\/p>\n\n\n\n<p id=\"63fd\"><em>“Is that all they teach you in class? All you seem to know is switching on and off things”<\/em>,<em>&nbsp;<\/em>he giggled.<\/p>\n\n\n\n<p id=\"f0fb\">Maybe that’s just a literary man’s peculiar perspective of all people in science and engineering related. Notwithstanding the fact that I later discovered much more about his other peculiar interests.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-1024x683.jpg\" alt=\"\" class=\"wp-image-730\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068901-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"1a94\">Another couple hours as a valet?<\/h2>\n\n\n\n<p id=\"99de\">It felt odd because we were having coffee at dinner time, which meant that what we were about to do next was just a wild card. And therefore the three of us ended up purposelessly strolling through Bath’s beautifully damp streets and its reflective puddles.<\/p>\n\n\n\n<p id=\"c666\">This is where the 9999 steps come into play. Not that it was actually 9999, since it’s more like 9970 according to the Health App on my iPhone. Regardless, this was enough to take us to Bath-on-ice, where we unfortunately did not bother to skate on, the Circus and the Royal crescent, in its majestically deserted state at night, and 3 miles out into the west, before heading back (roughly) along the original route.<\/p>\n\n\n\n<p id=\"3d07\">Sadly the consequent conversations were not very interesting because they started discussing about the perils of starting a business in the UK, where they mixed in many finance and marketing jargon which I did not understand. Not in a pretentious way, but enough to switch me off.<\/p>\n\n\n\n<p id=\"d280\">And so I walked behind them, ocasionally holding on to Arjun’s umbrella, like a Valet. At some point of the conversation Nas started discussing the things involved when it comes to balancing a career and a family, and out of the blue she said,<\/p>\n\n\n\n<p id=\"7bc8\"><em>“You remind me of my two boys.”<\/em><\/p>\n\n\n\n<p id=\"e03a\">Thank you.<\/p>\n\n\n\n<p id=\"001e\">Actually, no.<\/p>\n\n\n\n<p id=\"9672\">In your eyes I might be a kid but I’m 20. Not clueless. Or at least not as clueless. Hopefully this piece serves as a good indicator of that.<\/p>\n\n\n\n<p id=\"abfc\">Yet I suspect it serves the exact opposite purpose. Nevermind.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-1024x768.jpg\" alt=\"\" class=\"wp-image-731\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-1024x768.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-300x225.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-768x576.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-1536x1152.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068881-2048x1536.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"11a5\">Inward bound<\/h2>\n\n\n\n<p id=\"7cae\">At the spur of the moment, we realised we were already nearly 3 miles away from the city centre. Out in the middle of nowhere. Even though it was not exactly nowhere because I have previously looked up this part of the town when I was doing a bit of research for the Bath-Bristol Railway Path which I skated the next afternoon.<\/p>\n\n\n\n<p id=\"f606\">So inward-bound we went.<\/p>\n\n\n\n<p id=\"0571\">Some time on the way back, I caught Nas’ eyes scanning all over the pavement.<\/p>\n\n\n\n<p id=\"6950\">This puzzled me.<\/p>\n\n\n\n<p id=\"6bcd\">So I followed her gaze.<\/p>\n\n\n\n<p id=\"98e7\">But all I saw were shrubs struggling to find their way up in the murky grit-filled gaps between the concrete cracks, a bunch of consumed cigarette butts with heavily burnt ends, and pieces of broken glass bottles which a lousy drunk man must have dropped.<\/p>\n\n\n\n<p id=\"afe5\">Ah.<\/p>\n\n\n\n<p id=\"5c9f\">It appears that she’s in search of a lighter, which she must have lost a while ago. And consequently, for the entirity of the night, she has been asking strangers, even ones on their phones, for lighters.<\/p>\n\n\n\n<p id=\"193c\">I couldn’t help but notice how this resembled something that happened earlier in the day, when I lost a set of wired headphones which I normally use for museum audio guides. I got them for £2 months ago, but now that I lose them I feel slightly disoriented when touring a museum.<\/p>\n\n\n\n<p id=\"4598\">It’s odd how we are all so attached to certain objects that we take for granted, yet we lose hold of them so easily.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-1024x683.jpg\" alt=\"\" class=\"wp-image-732\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057815-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">The Holbourne Museum<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"6870\">Temptatious Indian food, but (sadly) not Kamasutra<\/h2>\n\n\n\n<p id=\"38c5\">There we were, at an Indian restaurant called “Temptations”, which sits on the second floor of a corner block right across the Bath Abbey. Most would find the view of the abbey attractive, but I personally find the purplish lights on the abbey uninviting and distracting. The interiors of the restaurant, however, is pretty nice, but that’s on account of the fact that I have a soft-spot for teal-colored furniture (or things in general).<\/p>\n\n\n\n<p id=\"376a\">When I normally enter a restaurant, I only remove my stained windbreaker and my blue down jacket, but to me this place feels a bit too warm that I had the urge to remove my fleece sweater as well. The atmosphere is nowhere as steamy as Kamasutra, but to me it still seems offly warm.<\/p>\n\n\n\n<p id=\"b36e\">This makes me think — “Temptations”, “Kamasutra” and all these stimulating Indian restaurant names — is this literally what Indians need food for, or just a silly British appropriation for Indian culture in general?<\/p>\n\n\n\n<p id=\"b447\">Since Nas and I were feeling lazy, we gave Arjun the liberty to order everything for us. You would think an Indian would do an excellent job ordering for everyone, but somehow to my unsophisticated tastebuds every curry just tastes nearly the same.<\/p>\n\n\n\n<p id=\"3482\"><em>“Everything okay?”<\/em><\/p>\n\n\n\n<p id=\"84c9\">As usual, here comes the line that I dare not recite at every restaurant I’ve been to in the UK,<\/p>\n\n\n\n<p id=\"d440\"><em>“Thank you, the food is very nice.”<\/em><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-1024x768.jpg\" alt=\"\" class=\"wp-image-733\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-1024x768.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-300x225.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-768x576.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-1536x1152.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-2048x1536.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Stall Street<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"02e6\">More unthreading<\/h2>\n\n\n\n<p id=\"3514\">Back at the hostel, I was slightly bummed that we did not end up at the bar, which was how I imagined every solo traveller would end his or her day.<\/p>\n\n\n\n<p id=\"eb46\">All because Arjun drinks everything but alcohol at a bar.<\/p>\n\n\n\n<p id=\"7bbd\">But on the bright side I do get to save quite a bit of cash, and recount most of the conversations that took place that night.<\/p>\n\n\n\n<p id=\"de1a\"><em>“I’m tired”<\/em>, complained Nas.<\/p>\n\n\n\n<p id=\"26b7\"><em>“Just a couple more moments”<\/em>, said Arjun, in a needy tone,&nbsp;<em>“You should check out the chill-out-room, and we could chill-out for a bit.”<\/em><\/p>\n\n\n\n<p id=\"cfdc\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"3d9c\"><em>“Yes.”<\/em><\/p>\n\n\n\n<p id=\"b013\">This sort of back-and-forth push-me-pull-you went on for a while. For those of you into animals, you know there’s a really cool animal called push-me-pull-you right? You can pop that on Google and millions of results will prove that……..<\/p>\n\n\n\n<p id=\"8ab9\">The complaining and convincing continued endlessly, and reluctantly Nas dragged herself along with us to the chill-out-room. That took quite a while, because the room is located on the loft of the building, which means we had to take at least 4 flights of stairs from the entrance.<\/p>\n\n\n\n<p id=\"5ea8\">I have to admit, when I entered the chill-out-room for the first time the previous afternoon, it actually looked disappointing compared to what the name suggests.<\/p>\n\n\n\n<p id=\"c699\">The room is dimly lit with a couple fluorecent tubes, with only a hint of warmth given from the street lamps on ground level. There are 2 comfortless couches immediately to the right of the door, opposite to each other, then a small table in the far right corner, adjacent to a bookshelf of random traveller books and a stack of depressingly outdated card games, and finally a TV-coffee-table-couch combination in the upper left corner. There’s two mini fridges and a microwave next to the door, but sadly there’s no kitchen, which was something I was looking forward to at a hostel.<\/p>\n\n\n\n<p id=\"631f\">Anyways, more unthreading continued.<\/p>\n\n\n\n<p id=\"ddee\"><em>“How old are your two kids?”<\/em><\/p>\n\n\n\n<p id=\"ea34\">She murmured two specific numbers which I did not remember.<\/p>\n\n\n\n<p id=\"325d\"><em>“So who’s taking care of them?”<\/em><\/p>\n\n\n\n<p id=\"11e5\"><em>“Their father,”&nbsp;<\/em>which is what I remember she specifically said. After a couple blinks, she continued,&nbsp;<em>“we are seperated”.<\/em><\/p>\n\n\n\n<p id=\"0bfa\">From there on, she ventilated her relationship with her divorced husband, in a relatively impartial manner. They had been dating since university, and had been quite close to each other career-wise. But recently they had been fighting constantly, and she had been domestically abused by her husbsand. Therefore she decided to get a divorce.<\/p>\n\n\n\n<p id=\"ae55\">From appearances alone it seems that she has moved on from her husband, since she’s aspiring for more abitious goals in her career by opting to study a Masters in Finance. She’s the upwardly mobile type that I have great respect for.<\/p>\n\n\n\n<p id=\"e6bf\">But to some extent, her decision to pursue a Masters away from home is driven by a desire to offload the emotional baggage resulted from her broken relationship. Looking at her Instagram posts, it is evident that she misses her two boys, and strangely, the fights with her husband as well. In contrary she claims to have lost faith in love, and that love never existed in the first place.<\/p>\n\n\n\n<p id=\"322c\">This was when Arjun stepped in and asked her a series of provocative down-to-the-bone questions, in a manner that I would describe is similar to the first conversation I had with him.<\/p>\n\n\n\n<p id=\"39a8\"><em>“Why did you love him in the first place?”<\/em><\/p>\n\n\n\n<p id=\"0ceb\">All I remember is that her response was a bunch of tangled loops that circled around their initial romance.<\/p>\n\n\n\n<p id=\"8a40\"><em>“Were the two sons planned?”<\/em><\/p>\n\n\n\n<p id=\"bab9\">She said yes.<\/p>\n\n\n\n<p id=\"5a75\"><em>“Then something must have motivated you two to do so.”<\/em><\/p>\n\n\n\n<p id=\"d745\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"3569\"><em>“Yes.”<\/em><\/p>\n\n\n\n<p id=\"32ca\">Undeterred, he embarked on a fifthteen minute lecture describing his thirteen-year relationship with his previous girlfriend, whom he maintains contact till this day because they’ve known each other since elementary school and their families are all still banded together. Their relationship was like any other regular relationship, until it experiened a pivotal change on a night they went to the movies.<\/p>\n\n\n\n<p id=\"b9a5\"><em>“Towards the end of the movie, as we were leaving their seats, a mysterious man approached us and asked my girlfriend out. But not asking her out.”<\/em><\/p>\n\n\n\n<p id=\"b6b4\">Precisely the man found her attractive and asked her to try out a part in a television show. They agreed. And long story short, they started spending less time with each other, and sadly as a horny artist Arjun decided to seek for various encounters. Either way, he soon became very absorbed in his work that their relationship was falling apart.<\/p>\n\n\n\n<p id=\"ec00\">I do not find this story helpful in any way.<\/p>\n\n\n\n<p id=\"082a\">“It didn’t work, but it doesn’t mean that love does not exist.”<\/p>\n\n\n\n<p id=\"e87f\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"ee67\"><em>“Yes.”<\/em><\/p>\n\n\n\n<p id=\"d4da\">It’s a case of a desperate salesman trying to convince a buyer who does not want to be sold. Why are you both doing this to yourself?<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"1024\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-768x1024.jpg\" alt=\"\" class=\"wp-image-734\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-768x1024.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-225x300.jpg 225w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-1152x1536.jpg 1152w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-1536x2048.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058651-scaled.jpg 1920w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" \/><\/figure>\n\n\n\n<p id=\"2654\">Now that I write this (or more precisely type this because I’m not a cultured literature freak), I realise that the conflict and struggle she faces is beyond my perception, even if words could be found to describe it. In fact, as I take a quick glance through what I’ve written in this section, more than a quarter of it is used to describe the setting of the chill-out-room.<\/p>\n\n\n\n<p id=\"b4a9\">I do love wandering in a little world of my own, don’t I?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Good morning It was nine o’ clock. Gotta grab something before the hostel breakfast ends at nine thirty. More context —the hostel offers “continental breakfast”, and whatever kind of splendid food you associate it with, it’s just an overglorified name for cereals, toasts and fruits. Maybe ham as well if you’re an early bird, but [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":733,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2],"tags":[29,16,17,20],"class_list":["post-725","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","tag-bath","tag-personal","tag-photography","tag-travel"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058409-1024x768.jpg","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/725","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=725"}],"version-history":[{"count":2,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/725\/revisions"}],"predecessor-version":[{"id":755,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/725\/revisions\/755"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/733"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=725"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=725"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=725"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}