{"id":737,"date":"2022-02-11T21:48:00","date_gmt":"2022-02-11T21:48:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=737"},"modified":"2025-08-14T21:38:29","modified_gmt":"2025-08-14T21:38:29","slug":"contemporary-persuasion-3-primark-ms-and-hm","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/11\/737","title":{"rendered":"Contemporary Persuasion 3: Primark, M&amp;S and H&amp;M"},"content":{"rendered":"\n<figure class=\"wp-block-image alignwide size-full\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1068687.webp\" alt=\"\" class=\"wp-image-738\"\/><\/figure>\n\n\n\n<div style=\"height:22px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"2455\">Primark, M&amp;S and H&amp;M<\/h1>\n\n\n\n<p id=\"156f\">Primark, M&amp;S and H&amp;M. These are probably the last places you would end up when travelling, especially if you’re travelling solo. But these were precisely the places we went to on the third morning of our trip.<\/p>\n\n\n\n<p id=\"6859\">The reason?<\/p>\n\n\n\n<p id=\"6f14\">Arjun and Nas. And maybe, just maybe, the allure of a free hot beverage when you spend time with a post-midlife-crisis thirty-five year old and a soul-searching twenty-seven year old.<\/p>\n\n\n\n<p id=\"8836\">Precisely, Nas insisted on doing a bit of shopping so as to get her friend a gift. A friend who had been under hospitalisation for awhile, whom she would have to return to London today to take care of her. In fact, Arjun spent the entire night trying to convince Nas to delay her return, but nothing changed her mind.<\/p>\n\n\n\n<p id=\"e809\"><em>“I have to go back tomorrow.”<\/em><\/p>\n\n\n\n<p id=\"b61f\"><em>“Yes. You’re going back on the morning of the 31st.”<\/em><\/p>\n\n\n\n<p id=\"0548\"><em>“Yes……no, I’m going back tomorrow”.<\/em><\/p>\n\n\n\n<p id=\"746b\"><em>“Yes, we can head to Bournemouth tomorrow, and then head back to London afterwards.”<\/em><\/p>\n\n\n\n<p id=\"9e3e\"><em>“Afterwards?”<\/em><\/p>\n\n\n\n<p id=\"d8cc\"><em>“Yes, maybe tomorrow evening, maybe the morning afterwards.”<\/em><\/p>\n\n\n\n<p id=\"0a54\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"5a21\">I sensed Arjun’s desperation in the conversation, but anyhow I’m too young to comment on that. That said, I wish I do have the spontaneity he has to travel to “wherever the weather is nice”.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058262-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-739\"\/><figcaption class=\"wp-element-caption\">The Royal Crescent Lawn<\/figcaption><\/figure>\n\n\n\n<p id=\"ab39\">Regardless, at this very moment, Nas just wanted to get the shopping all over with in ten minutes. I tend to think that’s the way I shop as well.<\/p>\n\n\n\n<p id=\"b66f\"><em>List, list, list.<\/em><\/p>\n\n\n\n<p id=\"cf78\"><em>Try, try, try.<\/em><\/p>\n\n\n\n<p id=\"ac07\"><em>Check, check, check.<\/em><\/p>\n\n\n\n<p id=\"e39b\"><em>Done, done done.<\/em><\/p>\n\n\n\n<p id=\"2cc3\">Except I’m cost-wise conscious with my spending on clothes, because I spend quite a bit on other important things in life, at least at this point in time, like skates and trainspotting tickets. So when I go clothes-shopping I browse through the same few isles over and over, hunting for the right colors and right prices.<\/p>\n\n\n\n<p id=\"3c04\">I tend to think that I get my priorities right.<\/p>\n\n\n\n<p id=\"1516\">In contrast Arjun is the kind that spends time crafting coherent combinations for different ocassions. It’s amazing how he has a decent amount of knowledge in both men’s and women’s fashion, but I’m not surprised, considering that he’s very self-conscious when it comes to his appearance — he carries a white suit and a pair of leather shoes wherever he goes, just in case he meets “the one” for him. And to this day, I don’t think I have taken a selfie with him without his beanie on, because he’s too uncomfortable about his slightly messed up hair.<\/p>\n\n\n\n<p id=\"3a77\">Therefore, we ended up browsing through several shops along the high street.<\/p>\n\n\n\n<p id=\"fb37\">TKMaxx? Too cheap. This saddens me a bit, because while it does seem like a clearance outlet, ever since I’ve come to the UK for university I’ve personally done most of my clothes shopping at TKMaxx.<\/p>\n\n\n\n<p id=\"052f\">M&amp;S? (Surprisingly) No formal wear for women and seems to cater to a demographic beyond our age. (No offence to M&amp;S lovers, this does not mean you’re old)<\/p>\n\n\n\n<p id=\"b57f\">H&amp;M? The cuttings do not seem inclusive for non hour-glass figures.<\/p>\n\n\n\n<p id=\"29e1\">And so we did not purchase a single item at all. I wondered if Nas actually wanted to purchase anything in the first place, or it was just an excuse to escape the rain and wander about with us (him).<\/p>\n\n\n\n<p id=\"27f8\">On a peculiar note, Arjun said I should dress older. Quit the dark colors and the funny orange beanie.<\/p>\n\n\n\n<p id=\"5f18\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"9a70\"><em>“Yes.”<\/em><\/p>\n\n\n\n<p id=\"4947\">It would be interesting to go clothes shopping with Arjun, though I’m naturally skeptical of changes that might drastically influence the perception of my identity.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide size-full\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057923.webp\" alt=\"\" class=\"wp-image-740\"\/><\/figure>\n\n\n\n<div style=\"height:22px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"ad9a\">Talking art at a non-artisan coffee shop<\/h2>\n\n\n\n<p id=\"fab0\">After that, we spent another couple hours at a cafe, the SOHO Coffee place that we passed by several times last evening. It’s nowhere as charismatic as the one we’ve been to yesterday, though it still offers the same hearty environment for casual conversations. Interestingly there were several guys at the table adjacent to us playing a board game that looked similar to the seven wonders.<\/p>\n\n\n\n<p id=\"f015\">An iced mocha and a slice of lemon cake for Arjun, an Expresso without milk for Nas, and a hot chocolate for me.<\/p>\n\n\n\n<p id=\"819a\">Arjun gave me a quick chuckle. Forgive me, I’m a child. I love the cute marshmallows and frothing cream drifting aloft the rich milky chocolate. Maybe I go for a Mocha ocassionally, but if I had to be honest I’m just craving for the 50% of chocolate in a Mocha.<\/p>\n\n\n\n<p id=\"21f9\">And again the salesman continues selling to the buyer who does not want to be sold. This time regarding the motivations behind art, because Arjun must have been sharing his pieces.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058109-1024x768.jpg.webp\" alt=\"\" class=\"wp-image-741\"\/><\/figure>\n\n\n\n<p id=\"fa60\">Nas says that art is motivated by both the artist and buyer seeking for some form of emotional expression or release, which means that the intentions of the artist mostly correspond to that of the buyer. Therefore, the price of the artwork is merely an indicator of the amount of compensation given to the artist for his or her contribution.<\/p>\n\n\n\n<p id=\"5127\">In contrast, Arjun says artists by in large produce two types of artwork. It’s either “artwork” that has large public appeal and will likely get sold, or real art that conveys the artist’s emotions and gets sold (and bought) for arbitrary reasons. He argues that the latter is the key motivator for today’s artwork market, and that those “arbitrary reasons” are more often than not dick measuring contests, where wealthy clueless folks purchase art for the sake of showing off their wealth. Therefore, the price merely shows how much the artwork has been overhyped by people who do not know art at all.<\/p>\n\n\n\n<p id=\"2eef\">In retrospect, it is ironic and disheartening that a self proclaimed artist, philosopher (whatever) possesses such a cynical view on this topic. As a matter of fact, he recently told me that he has been working on a series of novels, plays and poems that are all dedicated to his encounters, both during his solo travelling trips and at university.<\/p>\n\n\n\n<p id=\"426f\"><em>“No.”<\/em><\/p>\n\n\n\n<p id=\"ef11\"><em>“Yes.”<\/em><\/p>\n\n\n\n<p id=\"5df5\">…<\/p>\n\n\n\n<p id=\"517a\">I fail to capture the assertiveness in Arjun’s voice, but time after time he deliberately says hurtful things like&nbsp;<em>“you’re wrong”<\/em>&nbsp;or&nbsp;<em>“you’re stupid”<\/em>&nbsp;whenever he thinks he’s right. Which he most likely is, considering that he is knowledgeable of the market from both an academia and professional standpoint. But this obviously heightens the tension and goes against his efforts to be charming.<\/p>\n\n\n\n<p id=\"c668\"><em>“I don’t want to talk about this anymore,”<\/em>&nbsp;as she stood up from the couch and stepped away from the table. A physically powerful move indeed.<\/p>\n\n\n\n<figure class=\"wp-block-image alignfull size-full\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058250.webp\" alt=\"\" class=\"wp-image-742\"\/><\/figure>\n\n\n\n<p id=\"e024\">This is how they ended the conversation. In fairness the conflict was never detrimental at all, considering that it was not something deeply personal to both of them.<\/p>\n\n\n\n<p id=\"d8f5\">Some nagging continued until we farewelled Nas at the railway station.<\/p>\n\n\n\n<p id=\"96af\">On the bright side, it’s finally time for a bit of actual solo travelling of my own, and immediately afterwards I roller skated all the way from Bath to Bristol. The landscapes along the route is highly varied — first it runs along the river Avon, then the Avon Valley Heritage Railway and its abandoned railway tunnel, and finally some unremarkable British suburban landscapes between Warmley and Bristol. A very interesting, but perhaps a bit too interesting (lengthy, slippery, dark) for skates. More on this in another blog.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Primark, M&amp;S and H&amp;M Primark, M&amp;S and H&amp;M. These are probably the last places you would end up when travelling, especially if you’re travelling solo. But these were precisely the places we went to on the third morning of our trip. The reason? Arjun and Nas. And maybe, just maybe, the allure of a free [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":739,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2],"tags":[29,16,17,20],"class_list":["post-737","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","tag-bath","tag-personal","tag-photography","tag-travel"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058262-1024x683.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/737","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=737"}],"version-history":[{"count":2,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/737\/revisions"}],"predecessor-version":[{"id":753,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/737\/revisions\/753"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/739"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=737"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=737"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=737"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}