{"id":745,"date":"2022-02-11T22:09:00","date_gmt":"2022-02-11T22:09:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=745"},"modified":"2024-01-24T22:17:55","modified_gmt":"2024-01-24T22:17:55","slug":"contemporary-persuasion-4-juicier-stuff","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/11\/745","title":{"rendered":"Contemporary Persuasion 4: Juicier Stuff"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-1024x683.jpg\" alt=\"\" class=\"wp-image-746\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058522-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">A view from Alexandra Park<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vw\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"5e04\">Home sweet home, London<\/h1>\n\n\n\n<p id=\"8b3d\">I think solo travellers rarely expect any sort of re-engagement with people whom they’ve met during the trip. At least that was what I thought because sadly I don’t re-engage with most people I meet during the college fresher’s fair.<\/p>\n\n\n\n<p id=\"89ed\">But this trip is no college fresher’s fair, because we decided to meet again in London. Apparently Arjun left a pair of jeans in the hostel, and so as a “valet” I had to take it to him at our earliest convenience. A nice excuse for coffee though.<\/p>\n\n\n\n<p id=\"04b5\">So on the afternoon of New Year’s eve we came to South Bank.<\/p>\n\n\n\n<p id=\"4aef\">South Bank is pretty charming. The repetitive yet captivating patterns of the National Theatre’s ceiling (which appears oddly underrated), the neon-y lights beneath the Waterloo Bridge, the reflections on the shimmering waves of the Thames, the hippy skateboarders skidding on the rails of the skatepark ramps, the rows of distracting festive lights glistening in front of the cafes’ (which were sadly about to close), and the casually strolling crowds……..it just carries you away. I think I did spent several minutes just staring into the skatepark, except for no apparent reason it was soon shut by a couple security guards with tall metallic fences.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-1024x768.jpg\" alt=\"\" class=\"wp-image-749\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-1024x768.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-300x225.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-768x576.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-1536x1152.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058459-2048x1536.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p id=\"6c03\">When I arrived Nas and Arjun were both standing in front of a long concrete bench beside the promenade. Admittedly I was a bit lost so I did hadto get Arjun to wave to me, so perhaps that was why they were both standing.<\/p>\n\n\n\n<p id=\"1f85\"><em>“Hey scientist boy.”<\/em><\/p>\n\n\n\n<p id=\"d9b9\">Still? Okay, I should get used to this.<\/p>\n\n\n\n<p id=\"905e\">Only to be expected from previous events, things started to get weird. Nas was about to leave for a boat party. Arjun begged her to stay. Back and forth, more push-me-pull-you-ing.<\/p>\n\n\n\n<p id=\"962e\">I’m not sure how I can vividly describe a situation like this again, and in fact for a moment I kind of regretted coming to Southbank and getting in between them. One thinks that I remind her of her child, and the other thinks I know nothing but switching fancy lamps on and off — why do I get myself in between two mid\/ post-mid life crises? Hanging out with people beyond my age is unnatural or to some extent creepy, but obviously my curiosity motivated me to engage myself in something intricately fragile like this.<\/p>\n\n\n\n<p id=\"25cd\">I think I must have mentally drifted away for the next half and hour or so, because all I now recall is this random yet vivid moment.<\/p>\n\n\n\n<p id=\"b3f6\">As like before, Nas was sitting on the bench, but Arjun was standing in front of her, with a coffee in his hand. Then Nas grabbed my arm.<\/p>\n\n\n\n<p id=\"6358\">Huh?<\/p>\n\n\n\n<p id=\"389f\"><em>“Don’t let him do this to me,”<\/em>&nbsp;she uttered.<\/p>\n\n\n\n<p id=\"c4af\">I responded with what must have been an embarassingly clueless teeth-revealing smile.<\/p>\n\n\n\n<p id=\"9212\"><em>“You shouldn’t smile like this to girls,”<\/em>&nbsp;he chuckled.<\/p>\n\n\n\n<p id=\"4b10\">What?<\/p>\n\n\n\n<p id=\"8960\">After clearing the misty confusions, I realised the reason behind all these awkwardness —thinking that Arjun is already in a relationship with someone, Nas was afraid she would fall in love with him and step beyond bounds.<\/p>\n\n\n\n<p id=\"da15\">I do agree. Because from the looks of it, Arjun’s involved in several scandalous romantic relationships simultaneously. Apart from the fact that once again, we are both “stupid” because while he does not have a romantic interest for Nas, he (claimed that he) was not currently in a relationship. That was when Arjun wanted to pull Nas aside for a personal conversation, and the aforemention scene happened.<\/p>\n\n\n\n<p id=\"4c2a\">After a while of relentless persuasions, the two of them stepped aside for a short conversation.<\/p>\n\n\n\n<p id=\"a291\">Did I bother guessing what was going on? Probably. Probably not.<\/p>\n\n\n\n<p id=\"f05c\">I just have to smile when I see them together, because they are mismatched in so many ways. To some extent this resembles a married couple stepping aside to resolve a conflict whilst leaving their child aside carelessly playing with his toys. Except I do not personally resonate with experiences like this — regardless of the fact that there is frequently some degree of quarelling between my parents (and sometimes me), more often than not they are mature to enough to be honest upfront such that it gets resolved upfront; and even if I were unfortunate enough to be placed in a position between them, I’m never told to take sides. Or at least this is the way I remember things.<\/p>\n\n\n\n<p id=\"8bd4\">Then Nas left.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-1024x683.jpg\" alt=\"\" class=\"wp-image-747\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1057783-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p id=\"adf5\">This does not mean the conversation ended though, because Arjun and I remained, and as expected his cynism took off and he began dissing on nothing but everything.<\/p>\n\n\n\n<p id=\"64f6\"><em>“You’re practically a Michaelangelo or Da Vinci of the twenty first century — a philosopher, an artist, an oddly, a lawyer,”<\/em>&nbsp;I said.<\/p>\n\n\n\n<p id=\"6b6d\">I say this with great confidence because I have never seen a man this degree of knowledge and exposure to so many aspects of culture and art (and even science as well), a genius yet a borderline mentally deluded maniac. It also doesn’t help that he is horny, like the stereotypical artist and philosopher.<\/p>\n\n\n\n<p id=\"9f5d\">I continued,&nbsp;<em>“Why aren’t there more philosophers like you?”<\/em><\/p>\n\n\n\n<p id=\"6eba\">Furthermore added,&nbsp;<em>“Why aren’t people like you appreciated in society nowadays?”<\/em><\/p>\n\n\n\n<p id=\"d60d\"><em>“First of all, there’s no such thing as an artist. There’s no such thing as a philosohper. An artist. A lawyer. An engineer. These are just titles. I’m just someone who thinks.”<\/em><\/p>\n\n\n\n<p id=\"da46\"><em>“Secondly, people nowadays are too superficial.”<\/em><\/p>\n\n\n\n<p id=\"af2b\">A scornful look on society indeed. Again he whirled into an endless diss on British culture, complaining about society over-worshipping Newton and many other historical figures, and how it hinders new paradigms of thinking from blossoming.<\/p>\n\n\n\n<p id=\"3dae\">Puzzingly he also associates this with the general public’s inability to elect competent leaders and make correct decisions in referendums, although I wouldn’t immediately attribute these political issues to the public’s “superficiality”. While ‘I do agree that the UK might not be the best example of a democracy, I believe in it’s (and by the transitive propery, a democracy’s) ability to sprout new ideas and self-correct its mistakes. That’s what matters to me.<\/p>\n\n\n\n<p id=\"d3d0\">He then wandered off and argued that this superficiality is why relationships today rarely work, because it solely exists to serve the interests of gaining wealth, fame and power. These people have their holidays at fancy hotels and their iteneraries booked and arranged for them. He respects this glamorous lifestyle, but regards it with caution and contempt.<\/p>\n\n\n\n<p id=\"8d37\">Now I see why he likes solo travelling.<\/p>\n\n\n\n<p id=\"c244\">Sadly, I don’t plan to summarise or recount this hour-long conversation entirely. As an IB student I always tend to think that I’m highly capable of thinking critically, and that these are the skills that will equip me for society. But clearly I rarely reflect upon my cultural and societal identity — I am someone who gets comfortable and accustomed to established ways of thinking, and I suspect this is the reason why I am perfectly habituated for assessment-based learning systems and religious beliefs.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-1024x683.jpg\" alt=\"\" class=\"wp-image-751\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-1024x683.jpg 1024w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-300x200.jpg 300w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-768x512.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-1536x1025.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-2048x1366.jpg 2048w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Widcombe<\/figcaption><\/figure>\n\n\n\n<p id=\"a057\">In a jokingly sentimental tone, he sang a couple lines “The Man Who Sold the World” — its lyrics are abstract and imperceptible, which resembles himself. I felt he should have sang this to Nas instead, though I reckon there are much better a songs to sing to someone you would like to charm, like “My Boy (My Girl)”.<\/p>\n\n\n\n<p id=\"a2ce\">That was when his phone started ringing. Soon, he began a series of calls with his ex’s, his parents, and them together……. this is what I call the pinnacle of relationships.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"e8f8\">Juicier stuff<\/h1>\n\n\n\n<p id=\"963d\">I got two calls from Arjun. Actually it was more than that, because I gave him many updates regarding people around me getting covid positive. Anyways these were the two calls that matter.<\/p>\n\n\n\n<p id=\"14c0\">The first call was on New Year’s day. Apparently Nas, still slightly tipsy from her boat party, called at 3AM in the morning and begged to head to Arjun’s home. Arjun had no idea where she was. And evidently she was drunk, so he did not want her to come. Later that morning she called and returned to Norwich. The call seemed to end on a sad note, but I was busily worrying about coronavirus spreading in the flat.<\/p>\n\n\n\n<p id=\"f137\">The second call was from several days ago. Nas has decided to come to London between the 15th and 17th, and stay at Arjun’s. It looks like the cards have all flipped.<\/p>\n\n\n\n<p id=\"091d\">Good luck.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"1024\" src=\"\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-768x1024.jpg\" alt=\"\" class=\"wp-image-750\" srcset=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-768x1024.jpg 768w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-225x300.jpg 225w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-1152x1536.jpg 1152w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-1536x2048.jpg 1536w, http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058549-scaled.jpg 1920w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" \/><\/figure>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"6939\">Epilogue<\/h1>\n\n\n\n<p id=\"e9c5\">I have finally finished this, and hopefully by the time you two get to read this, the tone does not seem all too melodramatic. In fact when I read through the entire blog, the last few sections seem (or if I were honest, is definitely) very hastily written. Recalling all the details in these events, the semtiment associated to these events, and more importantly my emotions at the time, is mentally taxing. Not that I have very sophisticated emotions anyways, which should have already made this task easier.<\/p>\n\n\n\n<p id=\"4693\">To tell you (all\/ both) the truth, I still think it’s weird to converse, at a personal level, with adults far beyond my age. One of you drink nothing but apple juice at a bar, the other thinks you two are in love, while I’m 20 and clueless and unsurprisingly I happily embrace that.<\/p>\n\n\n\n<p id=\"b1dc\">I have decided to write this all down, so that I can get this right. Or at least mostly right, because I am a blockhead and my forgetfulness gets in the way.<\/p>\n\n\n\n<p id=\"eb09\">Please don’t read this with your eidetic memory.<\/p>\n\n\n\n<p id=\"3097\">Now I shall stop remembering all this in an overly romanticised manner. After all I reckon the story must have already progressed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Home sweet home, London I think solo travellers rarely expect any sort of re-engagement with people whom they’ve met during the trip. At least that was what I thought because sadly I don’t re-engage with most people I meet during the college fresher’s fair. But this trip is no college fresher’s fair, because we decided [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":751,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2],"tags":[29,16,17,20],"class_list":["post-745","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","tag-bath","tag-personal","tag-photography","tag-travel"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058608-1024x683.jpg","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/745","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=745"}],"version-history":[{"count":1,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/745\/revisions"}],"predecessor-version":[{"id":752,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/745\/revisions\/752"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/751"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=745"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=745"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=745"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}