{"id":756,"date":"2022-02-25T22:26:00","date_gmt":"2022-02-25T22:26:00","guid":{"rendered":"https:\/\/yannichau.i234.me\/?p=756"},"modified":"2024-01-24T22:29:50","modified_gmt":"2024-01-24T22:29:50","slug":"solo-travelling-a-double-edged-sword","status":"publish","type":"post","link":"http:\/\/yanni-test-local-wp-newdb.local\/2022\/02\/25\/756","title":{"rendered":"Solo Travelling: A Double Edged Sword?"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058073-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-720\"\/><figcaption class=\"wp-element-caption\">Fashion Museum Bath<\/figcaption><\/figure>\n\n\n\n<div style=\"height:1vh\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"0b3b\">Finding the Right Pace<\/h1>\n\n\n\n<p id=\"ca2e\">I met Riya while having a brief breather at chill out room.<\/p>\n\n\n\n<p id=\"f496\">A bit more about her. After having a decently long conversation with her I learnt that she is from Kerala in South India, and that she’s a Catholic. To my mind this seems rather peculiar. Another Indian friend later explained to me that Kerala is a rather progressive part of India where people are in general well educated.<\/p>\n\n\n\n<p id=\"165c\">Anyhow she’s currently a Masters student at UAL doing sustainable design, and simultaneously she is trying to get oriented to the pace in London. At the moment She has come to Bath for a packed but brief getaway. Prior to arriving at the Inn she has been on a tour, where she visited Windsor Castle, the Stonehenge and the Roman Baths. To be honest this sounds like a complete torture to me. I’m here for a getaway, not a hectic travel-television-programme-like tour!<\/p>\n\n\n\n<p id=\"a6d2\">Nevertheless, as I flip through my albums I realise that there’s many places I’ve yet to visit, like the Bath Abbey and several other museums. Ironically I have managed to visit significantly less places than I would have done if I were to travel with my friends.<\/p>\n\n\n\n<p id=\"4e72\">Do I like this polarisingly different way of travelling? My plans for summer 2022 will tell.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058000-1024x683.jpg.webp\" alt=\"\" class=\"wp-image-757\"\/><\/figure>\n\n\n\n<div style=\"height:1vh\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"3e53\">Solo travelling again in a couple decades?<\/h1>\n\n\n\n<p id=\"35d0\">Wenny seems to be a “as a matter of fact” kind of girl. Our initial conversation was as follows:<\/p>\n\n\n\n<p id=\"79c3\"><em>“Try and guess where I’m from.”<\/em><\/p>\n\n\n\n<p id=\"59cd\"><em>“Malaysia or Singapore,”&nbsp;<\/em>as I could tell from her distinct intonations.<\/p>\n\n\n\n<p id=\"1dc4\"><em>“Guess what I studied.”<\/em><\/p>\n\n\n\n<p id=\"98ae\">I giggled. This I had no idea. How am I supposed to gauge your academic or professional background based on our first few words?<\/p>\n\n\n\n<p id=\"72b8\"><em>“I’m an engineer!”<\/em><\/p>\n\n\n\n<p id=\"28a0\">She then went on detailing her career experiences, walking me through the decisions she has made before arriving at semiconductors. For the purposes of this blog or journal I’m going to omit all that. But it is she trying to point out that most if not nearly all Malaysians who come to the UK are engineers? I hope this is not a self imposed stereotype that many just simply accept.<\/p>\n\n\n\n<p id=\"d308\">The juicy part then follows.<\/p>\n\n\n\n<p id=\"fd9e\">We conversed about the reasons were coming for a bit of solo travelling. I told her it was because I have several high school classmates visiting on 3 weeks, which felt slightly overwhelming (Update: I had dinner with all of them, and everyone but two of us, including me, caught coronavirus).<\/p>\n\n\n\n<p id=\"e6c8\">This must have resonated strongly with her, as she then kept rambling about her flat mates aunty, who has stayed with her for more than 6 months. Ocassionally she feels discluded because they converse with each other in Cantonese. In her eyes, her aunty, albeit a popular and established solo traveller and blogger, has, to some extent, become slightly selfish after all the solo travelling.<\/p>\n\n\n\n<p id=\"f932\">And boy (girl) that rambling went on for ages.<\/p>\n\n\n\n<p id=\"3c18\">This kept me thinking — should I still be solo travelling when I’m 50? As a matter of fact, I realised that solo travelling as uncovered a shockingly foreign side of myself — the bravery to try new experiences, an eagerness to seek for companionship, and a higher degree of self consciousness.<\/p>\n\n\n\n<p id=\"654f\">Or maybe, the real question is — how do I want solo travelling to change my life?<\/p>\n\n\n\n<p id=\"74e8\">Again time will tell.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide size-full\"><img decoding=\"async\" src=\"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058029.webp\" alt=\"\" class=\"wp-image-758\"\/><\/figure>\n\n\n\n<h1 class=\"wp-block-heading\" id=\"a1ca\">Atta Peak!<\/h1>\n\n\n\n<p id=\"58c2\">Contrary to anyone else I have seen during the trip, Atticus looks and speaks way older than he actually is. But this is a complement —he is knowledgeable, and more importantly the confidence and determinism he exhibits echoes that of someone many years beyond my age.<\/p>\n\n\n\n<p id=\"edc3\">Originally from Nigeria, Atticus is a 24 year-old techie working at a very famous (or infamous from certain perspectives) firm in Sillicon valley. I couldn’t help but notice everything about him that speaks American — his accent (obviously), the way he exclaims with overly dejavu expressions like “L-O-L” (with the letters spelt one by one), his energetic enthusiasm (sadly why is this something exclusively associated with Americans), and so many more bright qualities.<\/p>\n\n\n\n<p id=\"b164\">I did not remember much from the conversations we’ve had. But within our discord of discussions on the cultural differences between Americans and Brits (or Europeans in general), his perspective on the American Dream shook me the hardest.<\/p>\n\n\n\n<p id=\"0fc6\">In his opinion, the US is truly the land of gold and opportunities, and the American Dream is the motivation that has enabled him to endure all the hardships that has eventually led him to where he is today. From an objective standpoint, that remains true — engineers and software developers in the US are still overly well paid compared to their European counterparts, and the job market is a lot more mobile as well.<\/p>\n\n\n\n<p id=\"728b\">For me however, the statement appears rather ironic because the literature I have studied points towards the unattainability of the American Dream, and how the Dream was simply a product fabricated to lure innocent immigrants or the uneducated grassroots.<\/p>\n\n\n\n<p id=\"0a35\">Nevertheless, he also immediately reveals the flip side of the statement — people literally die of hunger when they have nothing. Whereas he explains that here in Europe, people can get by with social welfare regardless of how poor they are.<\/p>\n\n\n\n<p id=\"59dc\"><em>“In the US, the ceiling is so high. But the floor can be so low. So low.”<\/em><\/p>\n\n\n\n<p id=\"99c9\">True.<\/p>\n\n\n\n<p id=\"5246\">But as neither a true European or a true American myself, I don’t align either to the overly generous (though sometimes abused) social security systems in place in European Welfare states, or the capitalist way of life that Americans adore.<\/p>\n\n\n\n<p id=\"c366\">At the end of the day, I’m a Hong Konger.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Finding the Right Pace I met Riya while having a brief breather at chill out room. A bit more about her. After having a decently long conversation with her I learnt that she is from Kerala in South India, and that she’s a Catholic. To my mind this seems rather peculiar. Another Indian friend later [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":758,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[2],"tags":[29,17,20],"class_list":["post-756","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blogs","tag-bath","tag-photography","tag-travel"],"acf":[],"featured_media_src_url":"http:\/\/yanni-test-local-wp-newdb.local\/wp-content\/uploads\/2024\/01\/1058029-1024x577.webp","_links":{"self":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/756","targetHints":{"allow":["GET"]}}],"collection":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/comments?post=756"}],"version-history":[{"count":1,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/756\/revisions"}],"predecessor-version":[{"id":759,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/posts\/756\/revisions\/759"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media\/758"}],"wp:attachment":[{"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/media?parent=756"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/categories?post=756"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yanni-test-local-wp-newdb.local\/wp-json\/wp\/v2\/tags?post=756"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}